1/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;		// 0.1 for centimeters, 0.01 for milimeters

vertices
(
    (0 0 0)			// 0
    (6.28 0 0)		// 1
    (6.28 1 0)		// 2
    (0 1 0)			// 3
    (0 0 0.1)			// 4
    (6.28 0 0.1)		// 5
    (6.28 1 0.1)		// 6
    (0 1 0.1)			// 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 1 1) simpleGrading (1 1 1)
);

boundary
(
    left
    {
        type cyclic;
		neighbourPatch right;
        faces
        (
			(0 4 7 3)
			
        );
    }
    right
    {
        type cyclic;
		neighbourPatch left;
        faces
        (
            
            (2 6 5 1)
            
        );
    }
    empty
    {
        type empty;
        faces
        (
            (3 7 6 2)
			(1 5 4 0)
			(0 3 2 1)
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
