1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    left
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          1;
        startFace       39;
        matchTolerance  0.0001;
        neighbourPatch  right;
        transformType   translational;
        separation      (-6.279999999999999 0 0);
    }
    right
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          1;
        startFace       40;
        matchTolerance  0.0001;
        neighbourPatch  left;
        transformType   translational;
        separation      (6.279999999999999 0 0);
    }
    empty
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          160;
        startFace       41;
    }
)

// ************************************************************************* //
